In [1]:
#1. How to import pandas and check the version?
import pandas as pd
import numpy as np
pd.__version__

'0.23.0'

In [2]:
#2. How to create a series from a list, numpy array and dict?
import numpy as np
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))

ser1=pd.Series(mylist)
ser2=pd.Series(myarr)
ser3=pd.Series(mydict)

In [3]:
ser1.head()

0    a
1    b
2    c
3    e
4    d
dtype: object

In [4]:
ser2.head()

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [5]:
ser3.head()

a    0
b    1
c    2
e    3
d    4
dtype: int64

In [6]:
#3. How to convert the index of a series into a column of a dataframe?
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
ser = pd.Series(mydict)
#method 1
df1=ser.to_frame().reset_index()
#method 2
df2=pd.DataFrame(ser).reset_index()

In [7]:
ser.head()

a    0
b    1
c    2
e    3
d    4
dtype: int64

In [8]:
df1.head()

  index  0
0     a  0
1     b  1
2     c  2
3     e  3
4     d  4

In [9]:
df2.head()

  index  0
0     a  0
1     b  1
2     c  2
3     e  3
4     d  4

In [10]:
#4. How to combine many series to form a dataframe?
import numpy as np
ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))

#method 1 
df3=pd.DataFrame({'col1':ser1,'col2':ser2})
df3.head()

  col1  col2
0    a     0
1    b     1
2    c     2
3    e     3
4    d     4

In [11]:
type(df3)

pandas.core.frame.DataFrame

In [12]:
df3['col1'].dtypes

dtype('O')

In [13]:
df3.dtypes

col1    object
col2     int32
dtype: object

In [14]:
# method2
# Solution 1
df4 = pd.concat([ser1, ser2], axis=1)
df4.head()

   0  1
0  a  0
1  b  1
2  c  2
3  e  3
4  d  4

In [15]:
#5. How to assign name to the series’ index?
ser = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser.name='alphabets'
ser.head()

0    a
1    b
2    c
3    e
4    d
Name: alphabets, dtype: object

In [16]:
#6. How to get the items of series A not present in series B?
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])
ser1[~ser1.isin(ser2)]

0    1
1    2
2    3
dtype: int64

In [17]:
#7. How to get the items not common to both series A and series B?
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])
ser_u=pd.Series(np.union1d(ser1,ser2))
ser_i=pd.Series(np.intersect1d(ser1,ser2))
ser_u[~ser_u.isin(ser_i)]

0    1
1    2
2    3
5    6
6    7
7    8
dtype: int64

In [18]:
#8. How to get the minimum, 25th percentile, median, 75th, and max of a numeric series?
ser = pd.Series(np.random.normal(loc=10, scale=5, size=25))
#loc=mean ,scale=std
np.percentile(ser,[0,25,50,75,100])

array([ 1.92928551,  6.04544664,  9.88607632, 11.87473576, 16.84148061])

In [19]:
#9. How to get frequency counts of unique items of a series?

a=list('abcdefgh')
indices = np.random.randint(8, size=30)

ser = pd.Series(np.take(a, indices))
ser

0     g
1     g
2     a
3     f
4     f
5     e
6     b
7     b
8     e
9     f
10    a
11    d
12    h
13    h
14    d
15    a
16    a
17    e
18    f
19    a
20    b
21    c
22    a
23    e
24    d
25    d
26    d
27    f
28    b
29    f
dtype: object

In [20]:
ser.value_counts()

a    6
f    6
d    5
b    4
e    4
g    2
h    2
c    1
dtype: int64

In [21]:
#10. How to keep only top 2 most frequent values as it is and replace everything else as ‘Other’?
np.random.RandomState(100)
#np.random.randint(low,high,no_of_values)
ser = pd.Series(np.random.randint(1, 5, 12))
ser

0     3
1     4
2     2
3     1
4     1
5     4
6     2
7     3
8     2
9     3
10    2
11    2
dtype: int32

In [22]:
ser.value_counts()

2    5
3    3
4    2
1    2
dtype: int64

In [23]:
ser.value_counts().index[:2]

Int64Index([2, 3], dtype='int64')

In [24]:
ser[~ser.isin(ser.value_counts().index[:2])]='other'
ser

0         3
1     other
2         2
3     other
4     other
5     other
6         2
7         3
8         2
9         3
10        2
11        2
dtype: object

In [25]:
#11. How to bin a numeric series to 10 groups of equal size?
ser = pd.Series(np.random.random(20))
print(ser)

0     0.884531
1     0.878407
2     0.164500
3     0.034190
4     0.749827
5     0.246728
6     0.912890
7     0.819342
8     0.677206
9     0.908224
10    0.306592
11    0.944389
12    0.304413
13    0.020329
14    0.627720
15    0.031790
16    0.037579
17    0.072644
18    0.504409
19    0.233110
dtype: float64

In [26]:
pd.qcut(ser,10)

0                      (0.88, 0.909]
1                      (0.771, 0.88]
2                    (0.0656, 0.213]
3                   (0.0339, 0.0656]
4                     (0.648, 0.771]
5                     (0.213, 0.281]
6                     (0.909, 0.944]
7                      (0.771, 0.88]
8                     (0.648, 0.771]
9                      (0.88, 0.909]
10                    (0.281, 0.406]
11                    (0.909, 0.944]
12                    (0.281, 0.406]
13    (0.019299999999999998, 0.0339]
14                    (0.406, 0.648]
15    (0.019299999999999998, 0.0339]
16                  (0.0339, 0.0656]
17                   (0.0656, 0.213]
18                    (0.406, 0.648]
19                    (0.213, 0.281]
dtype: category
Categories (10, interval[float64]): [(0.019299999999999998, 0.0339] < (0.0339, 0.0656] < (0.0656, 0.213] < (0.213, 0.281] ... (0.648, 0.771] < (0.771, 0.88] < (0.88, 0.909] < (0.909, 0.944]]

Qcut (quantile-cut) differs from cut in the sense that, in qcut, the number of elements in each bin will be roughly the same, but this will come at the cost of differently sized interval widths. On the other hand, in cut, the bin edges were equal sized (when we specified bins=3) with uneven number of elements in each bin or group. Also, cut is useful when you know for sure the interval ranges and the bins,

In [27]:
pd.qcut(ser,10,labels=['1st', '2nd', '3rd', '4th', '5th', '6th', '7th', '8th', '9th', '10th'])

0      9th
1      8th
2      3rd
3      2nd
4      7th
5      4th
6     10th
7      8th
8      7th
9      9th
10     5th
11    10th
12     5th
13     1st
14     6th
15     1st
16     2nd
17     3rd
18     6th
19     4th
dtype: category
Categories (10, object): [1st < 2nd < 3rd < 4th ... 7th < 8th < 9th < 10th]

In [28]:
#12. How to convert a numpy array to a dataframe of given shape? (L1)
ser=pd.Series(np.random.randint(1,10,35))
ser

0     8
1     3
2     4
3     8
4     2
5     4
6     3
7     6
8     2
9     7
10    4
11    8
12    3
13    2
14    2
15    4
16    2
17    9
18    6
19    4
20    9
21    1
22    2
23    5
24    1
25    4
26    8
27    5
28    9
29    4
30    1
31    1
32    6
33    1
34    3
dtype: int32

In [29]:
df=pd.DataFrame(ser)
df

    0
0   8
1   3
2   4
3   8
4   2
5   4
6   3
7   6
8   2
9   7
10  4
11  8
12  3
13  2
14  2
15  4
16  2
17  9
18  6
19  4
20  9
21  1
22  2
23  5
24  1
25  4
26  8
27  5
28  9
29  4
30  1
31  1
32  6
33  1
34  3

In [30]:
df2=pd.DataFrame(ser.values.reshape(7,5),columns=['a','b','c','d','e'])
df2

   a  b  c  d  e
0  8  3  4  8  2
1  4  3  6  2  7
2  4  8  3  2  2
3  4  2  9  6  4
4  9  1  2  5  1
5  4  8  5  9  4
6  1  1  6  1  3

In [31]:
#13. How to find the positions of numbers that are multiples of 3 from a series?

ser=pd.Series(np.random.randint(1,20,10))
ser

0    17
1    15
2     1
3    14
4    16
5     3
6     1
7    15
8    10
9     5
dtype: int32

In [32]:
np.argwhere(ser%3==0)

array([[1],
       [5],
       [7]], dtype=int64)

In [33]:
#14. How to extract items at given positions from a series
ser = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]
ser.take(pos)

0     a
4     e
8     i
14    o
20    u
dtype: object

In [34]:
#15. How to stack two series vertically and horizontally ?
ser1 = pd.Series(range(5))
ser2 = pd.Series(list('abcde'))
#horizontal
ser3=pd.concat([ser1,ser2],axis=1)
#vertical
ser4=pd.concat([ser1,ser2],axis=0)

In [35]:
ser3

   0  1
0  0  a
1  1  b
2  2  c
3  3  d
4  4  e

In [36]:
ser4

0    0
1    1
2    2
3    3
4    4
0    a
1    b
2    c
3    d
4    e
dtype: object

In [37]:
from datetime import date

today = date.today()
print("Today's date:", today)

Today's date: 2021-10-27

### 17. How to compute the mean squared error on a truth and predicted series?

In [38]:
truth = pd.Series(range(10))
pred = pd.Series(range(10)) + np.random.random(10)
mse=np.mean((truth-pred)**2)
mse

0.4988641412970961

### 18. How to convert the first character of each element in a series to uppercase?

In [41]:
ser = pd.Series(['how', 'to', 'kick', 'ass?'])
ser2=ser.apply(lambda x:x.capitalize())
ser2

0     How
1      To
2    Kick
3    Ass?
dtype: object

In [42]:
#or
ser3=ser.map(lambda x:x.capitalize())
ser3

0     How
1      To
2    Kick
3    Ass?
dtype: object

In [43]:
#or
ser4=ser.map(lambda x:x.title())
ser4

0     How
1      To
2    Kick
3    Ass?
dtype: object

### 20. How to compute difference of differences between consequtive numbers of a series?

In [47]:
ser = pd.Series([1, 3, 6, 10, 15, 21, 27, 35])
ser1=ser.diff().tolist()
ser2=ser.diff().diff().tolist()

In [49]:
ser1

[nan, 2.0, 3.0, 4.0, 5.0, 6.0, 6.0, 8.0]

In [50]:
ser2

[nan, nan, 1.0, 1.0, 1.0, 1.0, 0.0, 2.0]

### 21. How to convert a series of date-strings to a timeseries?

In [51]:
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])
ser.head(1).dtype

dtype('O')

In [52]:
ser2=pd.to_datetime(ser)
ser2

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

In [55]:
ser2.head(1).dtype

dtype('<M8[ns]')

In [56]:
ser2.dtype

dtype('<M8[ns]')

### 22. How to get the day of month, week number, day of year and day of week from a series of date strings?

In [92]:
ser = pd.Series(['01 Jan 2010', '3-02-2011', '20120306', '2013/04/05', '2014-05-09', '2015-06-12T12:20','01 Jan 2021','10 Jan 2021','28 Oct 2021','31 Dec 2011','31 Dec 2011','31 Dec 2012','31 Dec 2020','31 Dec 2021'])
ser2=pd.to_datetime(ser)
ser2

0    2010-01-01 00:00:00
1    2011-03-02 00:00:00
2    2012-03-06 00:00:00
3    2013-04-05 00:00:00
4    2014-05-09 00:00:00
5    2015-06-12 12:20:00
6    2021-01-01 00:00:00
7    2021-01-10 00:00:00
8    2021-10-28 00:00:00
9    2011-12-31 00:00:00
10   2011-12-31 00:00:00
11   2012-12-31 00:00:00
12   2020-12-31 00:00:00
13   2021-12-31 00:00:00
dtype: datetime64[ns]

In [93]:
#day of month
ser2.dt.day.tolist()

[1, 2, 6, 5, 9, 12, 1, 10, 28, 31, 31, 31, 31, 31]

In [94]:
#monthof year
ser2.dt.month.tolist()

[1, 3, 3, 4, 5, 6, 1, 1, 10, 12, 12, 12, 12, 12]

In [95]:
#year
ser2.dt.year.tolist()

[2010,
 2011,
 2012,
 2013,
 2014,
 2015,
 2021,
 2021,
 2021,
 2011,
 2011,
 2012,
 2020,
 2021]

In [96]:
ser3=ser2.dt.year.apply(lambda x:x+1 ) # increasin the year by 1 
ser3

0     2011
1     2012
2     2013
3     2014
4     2015
5     2016
6     2022
7     2022
8     2022
9     2012
10    2012
11    2013
12    2021
13    2022
dtype: int64

In [97]:
#day of week =mon-0,tue-1,wed-2,thu-3,fri-4,sat-5,sun-6
#here 2010 ,1st jan is friday
ser2.dt.dayofweek.tolist()

[4, 2, 1, 4, 4, 4, 4, 6, 3, 5, 5, 0, 3, 4]

In [102]:

# day of week
print("Day of week: ", ser2.dt.weekday_name.tolist())

Day of week:  ['Friday', 'Wednesday', 'Tuesday', 'Friday', 'Friday', 'Friday', 'Friday', 'Sunday', 'Thursday', 'Saturday', 'Saturday', 'Monday', 'Thursday', 'Friday']

In [98]:
#weeknumber
ser2.dt.week.tolist()

[53, 9, 10, 14, 19, 24, 53, 1, 43, 52, 52, 1, 53, 52]

In [101]:
# day of year
print("Day number of year: ", ser2.dt.dayofyear.tolist())

Day number of year:  [1, 61, 66, 95, 129, 163, 1, 10, 301, 365, 365, 366, 366, 365]

### 23. How to filter words that contain atleast 2 vowels from a series?

In [103]:

ser = pd.Series(['Apple', 'Orange', 'Plan', 'Python', 'Money'])
# Solution
from collections import Counter
mask = ser.map(lambda x: sum([Counter(x.lower()).get(i, 0) for i in list('aeiou')]) >= 2)
ser[mask]

0     Apple
1    Orange
4     Money
dtype: object

### 24. How to filter valid emails from a series?

In [105]:
# Input
emails = pd.Series(['buying books at amazom.com on ashis@gmail.com', 'rameses@egypt.com', 'matt@t.co', 'narendra@modi.com'])
import re
pattern ='[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\\.[A-Za-z]{2,4}'
emails.str.findall(pattern, flags=re.IGNORECASE)

0      [ashis@gmail.com]
1    [rameses@egypt.com]
2            [matt@t.co]
3    [narendra@modi.com]
dtype: object

### 25. How to compute the euclidean distance between two series?

In [110]:
p = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
q = pd.Series([10, 9, 8, 7, 6, 5, 4, 3, 2, 1])
# Solution 
euc=(sum((p-q)**2))**0.5
euc

18.16590212458495

In [111]:
# Solution (using func)
np.linalg.norm(p-q)

18.16590212458495

### 26.  How to find all the local maxima (or peaks) in a numeric series?

In [132]:
#Get the positions of peaks (values surrounded by smaller values on both sides) in
# Input
ser = pd.Series([2, 10, 3, 4, 9, 10, 2, 7, 3])

np.diff(ser)

array([ 8, -7,  1,  5,  1, -8,  5, -4], dtype=int64)

In [133]:
np.sign(np.diff(ser))

array([ 1, -1,  1,  1,  1, -1,  1, -1], dtype=int64)

In [134]:
np.diff(np.sign(np.diff(ser)))

array([-2,  2,  0,  0, -2,  2, -2], dtype=int64)

In [135]:
np.where(np.diff(np.sign(np.diff(ser)))==-2)+1

TypeError: can only concatenate tuple (not "int") to tuple

In [136]:
np.where(np.diff(np.sign(np.diff(ser)))==-2)[0]+1

array([1, 5, 7], dtype=int64)

In [124]:
dd = np.diff(np.sign(np.diff(ser)))
peak_locs = np.where(dd == -2)[0] + 1
peak_locs

array([5], dtype=int64)

### 27. How to replace missing spaces in a string with the least frequent character?

In [138]:
#Replace the spaces in my_str with the least frequent characte
my_str = 'dbc deb abed gade'

ser=pd.Series(list(my_str))
ser

0     d
1     b
2     c
3
4     d
5     e
6     b
7
8     a
9     b
10    e
11    d
12
13    g
14    a
15    d
16    e
dtype: object

In [140]:
freq=ser.value_counts()
freq

d    4
     3
b    3
e    3
a    2
c    1
g    1
dtype: int64

In [144]:
freq_index=freq.index
freq_index

Index(['d', ' ', 'b', 'e', 'a', 'c', 'g'], dtype='object')

In [146]:
least_freq=freq_index[-1]
least_freq

'g'

In [147]:
ser1=ser.replace(' ',least_freq)
ser1.value_counts()

g    4
d    4
e    3
b    3
a    2
c    1
dtype: int64

In [148]:
ser1

0     d
1     b
2     c
3     g
4     d
5     e
6     b
7     g
8     a
9     b
10    e
11    d
12    g
13    g
14    a
15    d
16    e
dtype: object

In [149]:
ser1.tolist()

['d',
 'b',
 'c',
 'g',
 'd',
 'e',
 'b',
 'g',
 'a',
 'b',
 'e',
 'd',
 'g',
 'g',
 'a',
 'd',
 'e']

In [150]:
''.join(ser1.tolist())

'dbcgdebgabedggade'

### 28. How to fill an intermittent time series so all missing dates show up with values of previous non-missing date?

In [151]:
#ser has missing dates and values. Make all missing dates appear and fill up with value from previous date.

In [152]:
ser = pd.Series([1,10,3,np.nan], index=pd.to_datetime(['2000-01-01', '2000-01-03', '2000-01-06', '2000-01-08']))
print(ser)

2000-01-01     1.0
2000-01-03    10.0
2000-01-06     3.0
2000-01-08     NaN
dtype: float64

In [153]:
# Solution
ser.resample('D').ffill()  # fill with previous value

2000-01-01     1.0
2000-01-02     1.0
2000-01-03    10.0
2000-01-04    10.0
2000-01-05    10.0
2000-01-06     3.0
2000-01-07     3.0
2000-01-08     NaN
Freq: D, dtype: float64

In [154]:
# Alternatives
ser.resample('D').bfill()  # fill with next value

2000-01-01     1.0
2000-01-02    10.0
2000-01-03    10.0
2000-01-04     3.0
2000-01-05     3.0
2000-01-06     3.0
2000-01-07     NaN
2000-01-08     NaN
Freq: D, dtype: float64

In [155]:
# Alternatives
ser.resample('D').bfill().ffill()  # fill next else prev value

2000-01-01     1.0
2000-01-02    10.0
2000-01-03    10.0
2000-01-04     3.0
2000-01-05     3.0
2000-01-06     3.0
2000-01-07     3.0
2000-01-08     3.0
Freq: D, dtype: float64

### 29. How to compute the autocorrelations of a numeric series?

In [156]:
#Compute autocorrelations for the first 10 lags of ser. Find out which lag has the largest correlation.

In [157]:
ser = pd.Series(np.arange(20) + np.random.normal(1, 10, 20))
ser

0     -0.305345
1    -17.417985
2      9.580290
3      0.195610
4     13.597174
5    -20.314118
6      3.464824
7     23.902659
8      3.842334
9     -8.364650
10    17.316977
11    18.616947
12    15.771813
13    23.531026
14    16.548917
15    30.585078
16    11.570655
17    26.995920
18     6.583536
19    15.128300
dtype: float64

In [160]:
autocorrelations = [ser.autocorr(i).round(2) for i in range(11)]
autocorrelations

[1.0, 0.16, 0.2, 0.26, 0.55, 0.17, -0.08, 0.1, 0.24, 0.11, -0.16]

In [161]:
print(autocorrelations[1:])

[0.16, 0.2, 0.26, 0.55, 0.17, -0.08, 0.1, 0.24, 0.11, -0.16]

In [162]:
print('Lag having highest correlation: ', np.argmax(np.abs(autocorrelations[1:]))+1)

Lag having highest correlation:  4

### 30. How to import only every nth row from a csv file to create a dataframe?

In [163]:
#Import every 50th row of BostonHousing dataset as a dataframe.

# Solution 1: Use chunks and for-loop
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv', chunksize=50)
df2 = pd.DataFrame()
for chunk in df:
    df2 = df2.append(chunk.iloc[0,:])

In [167]:
df2

,age,b,chas,crim,dis,indus,lstat,medv,nox,ptratio,rad,rm,tax,zn
0,65.2,396.90,0.0,0.00632,4.0900,2.31,4.98,24.0,0.538,15.3,1.0,6.575,296.0,18.0
50,45.7,395.56,0.0,0.08873,6.8147,5.64,13.45,19.7,0.439,16.8,4.0,5.963,243.0,21.0
100,79.9,394.76,0.0,0.14866,2.7778,8.56,9.42,27.5,0.520,20.9,5.0,6.727,384.0,0.0
150,97.3,372.80,0.0,1.65660,1.6180,19.58,14.10,21.5,0.871,14.7,5.0,6.122,403.0,0.0
200,13.9,384.30,0.0,0.01778,7.6534,1.47,4.45,32.9,0.403,17.0,3.0,7.135,402.0,95.0
250,13.0,396.28,0.0,0.14030,7.3967,5.86,5.90,24.4,0.431,19.1,7.0,6.487,330.0,22.0
300,47.4,390.86,0.0,0.04417,7.8278,2.24,6.07,24.8,0.400,14.8,5.0,6.871,358.0,70.0
350,44.4,396.90,0.0,0.06211,8.7921,1.25,5.98,22.9,0.429,19.7,1.0,6.490,335.0,40.0
400,100.0,396.90,0.0,25.04610,1.5888,18.10,26.77,5.6,0.693,20.2,24.0,5.987,666.0,0.0
450,92.6,0.32,0.0,6.71772,2.3236,18.10,17.44,13.4,0.713,20.2,24.0,6.749,666.0,0.0
500,79.7,396.90,0.0,0.22438,2.4982,9.69,14.33,16.8,0.585,19.2,6.0,6.027,391.0,0.0

In [170]:
# Solution 2: Use csv reader
import csv          
with open('BostonHousing.csv', 'r') as f:
    reader = csv.reader(f)
    out = []
    for i, row in enumerate(reader):
        if i%50 == 0:
            out.append(row)

df2 = pd.DataFrame(out[1:], columns=out[0])
print(df2.head())

   0.00632  18.00   2.310  0  0.5380  6.5750  65.20  4.0900   1  296.0  15.30 396.90   4.98  24.00
0   0.08873  21.00   5.640  0  0.4390  5.9630  45...
1   0.14866   0.00   8.560  0  0.5200  6.7270  79...
2   1.65660   0.00  19.580  0  0.8710  6.1220  97...
3   0.01778  95.00   1.470  0  0.4030  7.1350  13...
4   0.14030  22.00   5.860  0  0.4310  6.4870  13...

# ASHIS KUMAR SAHU